WHERE 交易类型 = "转账"
	收/支 = "收入"
		当前状态 = "已存入零钱"		# 商品 = "转账备注：微信转账"，支付方式 = "/"，商户单号 = "/"
		当前状态 = 
	收/支 = ""
		当前状态 = "朋友已收钱"		# 商品 = "转账备注：微信转账"，商户单号 = "/"
			支付方式：零钱、xxx银行卡(xxxx)……
		当前状态

WHERE 交易类型 = "微信红包"		# 包括了个人红包和群红包
	当前状态 = "已存入零钱"			# 收/支 = "收入"，商品 = "/"，支付方式 = "/"
	当前状态 = 

WHERE 交易类型 = "微信红包（单发）"
	当前状态 = "支付成功"				# 收/支 = "支出"，交易对方 = "发给xxx"，商品 = "/"
		支付方式：零钱、xxx银行卡(xxxx)……
	当前状态 = "已全额退款"			# 收/支 = "支出"，交易对方 = "发给xxx"，商品 = "/"
									# 商户单号 = (交易类型="微信红包-退款".交易单号)

WHERE 交易类型 = "微信红包（群红包）"
	当前状态 = "支付成功"				# 收/支 = "支出"，交易对方 = "发出群红包"，商品 = "/"
		支付方式：零钱、xxx银行卡(xxxx)……
	当前状态 = "已退款(￥xxx.yy)"		# 收/支 = "支出"，交易对方 = "发出群红包"，商品 = "/"
		支付方式：零钱、xxx银行卡(xxxx)……		# 商户单号 = (交易类型="微信红包-退款".交易单号)

WHERE 交易类型 = "群收款"
	收/支 = "收入"
		当前状态 = "已存入零钱"		# 商品 = "/"，支付方式 = "/"，商户单号 = "/"
	收/支 = "支出"
		当前状态 = "支付成功"			# 商品 = "/"
			支付方式：零钱、xxx银行卡(xxxx)……

WHERE 交易类型 = "%-退款"
	交易类型 = "微信红包-退款"			# 交易对方 = "/"
		当前状态 = "已全额退款"			# 		 商品 = "/"
		当前状态 = "已退款￥xxx.yy"		# 群红包，商品 = "转账备注:微信转账"
	交易类型 = "转账-退款"
	交易类型 = "美团点评平台商户-退款"		# 交易对方 = "美团点评平台商户"，商品 = "美团点评平台商户"，商户单号 = ""
		当前状态
			支付方式：零钱、xxx银行卡(xxxx)……
	交易类型 = "携程旅行-退款"			# 交易对方 = "携程旅行"，商品 = "携程旅行"，商户单号 = ""
		当前状态
			支付方式：零钱、xxx银行卡(xxxx)……

WHERE 交易类型 = "扫二维码付款"
	当前状态 = "已转账"					# 商品 = "收款方备注:二维码收款"

WHERE 交易类型 = "商户消费"
	收/支 = "支出"
		当前状态 = "支付成功"	
			支付方式：零钱、xxx银行卡(xxxx)……
		当前状态 = 
			支付方式：零钱、xxx银行卡(xxxx)……
	收/支 = "收入"								# 支付方式 = "/"
		当前状态 = "充值成功"						# 交易对方 = "小黑卡订单退款"，商品 = "/"
		当前状态


